/**
 * question 1 不带头结点，递归实现删除所有X值结点
 * 递归终止：p == NULL
 * 递归主体：if(p == x)delete f(p->next)
*/

/**
 * question 2 带头结点，删除所有X值结点
 * 解法一: 
 * 设置前驱pre;
 * p->data == x; pre->next = p->next
 * 解法二：
 * 尾插法建立单链表，r指向尾结点，p结点值不等于x链接到r->next=p,r=p
*/

/**
 * question 3 从尾到头反向输出
 * 1. 借助栈，经过结点放入栈，遍历完链表从栈顶输出
 * 2. 递归
*/

/**
 * question 4 带头结点，删除最小值高效算法
 * 从头至尾扫描，
 * pre指向p的前驱，
 * minp保存值最小结点指针，
 * minpre保存最小结点指针前驱
 * 拓展：带头结点和不带头结点的实现方式
*/

/**
 * question 5 带头结点单链表逆置，空间复杂度O(1)
 * 解法一：头插法
 * 解法二：
*/

/**
 * question 6 带头结点，递增有序
 * 直接插入排序
*/